zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_SIM.h
#endif /* SIM_XBAR_INPUT_ADC_TMR_INDEX_T_ */

#if !defined(SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_)
#define SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_
typedef enum _sim_xbar_input_adc_tmr_selection
{
    kSIM_XBARIN36TMRA0              = 0U,          /**< xbar input 36, TMRA0. */
    kSIM_XBARIN36ADCAN0limit        = 1U,          /**< xbar input 36, ADC AN0 limit. */
    kSIM_XBARIN37TMRA1              = 0U,          /**< xbar input 37, TMRA1. */
    kSIM_XBARIN37ADCAN1limit        = 1U,          /**< xbar input 37, ADC AN1 limit. */
    kSIM_XBARIN38TMRA2              = 0U,          /**< xbar input 38, TMRA2. */
    kSIM_XBARIN38ADCAN2limit        = 1U,          /**< xbar input 38, ADC AN2 limit. */
    kSIM_XBARIN39TMRA3              = 0U,          /**< xbar input 39, TMRA3. */
    kSIM_XBARIN39ADCAN3limit        = 1U,          /**< xbar input 39, ADC AN3 limit. */
} sim_xbar_input_adc_tmr_selection_t;
#endif /* SIM_XBAR_INPUT_ADC_TMR_SELECTION_T_ */

#if !defined(SIM_SWRESET_PERI_INDEX_T_)
#define SIM_SWRESET_PERI_INDEX_T_
typedef enum _sim_swReset_peri_index
{
    kSIM_SWResetGPIO                = 6U,          /**< GPIO Software Reset. */
    kSIM_SWResetTMRA                = 15U,         /**< TMRA Software Reset. */
    kSIM_SWResetLPI2C0              = 21U,         /**< LPI2C0 Software Reset. */
    kSIM_SWResetLPI2C1              = 22U,         /**< LPI2C1 Software Reset. */
    kSIM_SWResetQSPI0               = 25U,         /**< QSPI0 Software Reset. */
    kSIM_SWResetSCI1                = 27U,         /**< SCI1 Software Reset. */
    kSIM_SWResetSCI0                = 28U,         /**< SCI0 Software Reset. */
    kSIM_SWResetDAC                 = 29U,         /**< DAC Software Reset. */
    kSIM_SWResetPIT1                = 34U,         /**< PIT1 Software Reset. */
    kSIM_SWResetPIT0                = 35U,         /**< PIT0 Software Reset. */
    kSIM_SWResetQDC                 = 36U,         /**< QDC Software Reset. */
    kSIM_SWResetCRC                 = 37U,         /**< CRC Software Reset. */
    kSIM_SWResetCADC                = 39U,         /**< Cyclic ADC Software Reset. */
    kSIM_SWResetCMP                 = 44U,         /**< CMP Software Reset. */
    kSIM_SWResetEWM                 = 47U,         /**< EWM Software Reset. */
    kSIM_SWResetPWMA                = 55U,         /**< PWMA Software Reset. */
    kSIM_SWResetDMAMUX              = 57U,         /**< DMA_MUX Software Reset. */
    kSIM_SWResetOPAMPB              = 58U,         /**< OPAMPB Software Reset. */
    kSIM_SWResetOPAMPA              = 59U,         /**< OPAMPA Software Reset. */
} sim_swReset_peri_index_t;
#endif /* SIM_SWRESET_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INDEX_T_)
#define SIM_INTERNAL_PERI_INDEX_T_
typedef enum _sim_internal_peri_index
{
    kSIM_SCI0_RXDInputIndex         = 0U,          /**< Select SCI0_RXD Input. */
    kSIM_SCI1_RXDInputIndex         = 1U,          /**< Select SCI1_RXD Input. */
    kSIM_TMRAInput0Index            = 8U,          /**< Select TMRA Input 0. */
    kSIM_TMRAInput1Index            = 9U,          /**< Select TMRA Input 1. */
    kSIM_TMRAInput2Index            = 10U,         /**< Select TMRA Input 2. */
    kSIM_TMRAInput3Index            = 11U,         /**< Select TMRA Input 3. */
} sim_internal_peri_index_t;
#endif /* SIM_INTERNAL_PERI_INDEX_T_ */

#if !defined(SIM_INTERNAL_PERI_INPUT_T_)
#define SIM_INTERNAL_PERI_INPUT_T_
typedef enum _sim_internal_peri_input
{
    kSIM_SCI0_RXDInput_GPIOC3_GPIOC8_GPIOF8 = 0U,  /**< Select SCI0_RXD Input, GPIOC3 or GPIOC8 or GPIOF8. */
    kSIM_SCI0_RXDInput_XB_OUT36     = 1U,          /**< Select SCI0_RXD Input, XB_OUT36. */
    kSIM_SCI1_RXDInput_GPIOC12_GPIOF5 = 0U,        /**< Select SCI1_RXD Input, GPIOC12 or GPIOF5. */
    kSIM_SCI1_RXDInput_XB_OUT37     = 1U,          /**< Select SCI1_RXD Input, XB_OUT37. */
    kSIM_TMRAInput0_GPIOC3          = 0U,          /**< Select TMRA Input 0, GPIOC3. */
    kSIM_TMRAInput0_XB_OUT38        = 1U,          /**< Select TMRA Input 0, XB_OUT38. */
    kSIM_TMRAInput1_GPIOC4          = 0U,          /**< Select TMRA Input 1, GPIOC4. */
    kSIM_TMRAInput1_XB_OUT39        = 1U,          /**< Select TMRA Input 1, XB_OUT39. */
    kSIM_TMRAInput2_GPIOC6          = 0U,          /**< Select TMRA Input 2, GPIOC6 . */
    kSIM_TMRAInput2_XB_OUT40        = 1U,          /**< Select TMRA Input 2, XB_OUT40. */
    kSIM_TMRAInput3_GPIOC13         = 0U,          /**< Select TMRA Input 3, GPIOC13 . */
    kSIM_TMRAInput3_XB_OUT41        = 1U,          /**< Select TMRA Input 3, XB_OUT41. */
} sim_internal_peri_input_t;
#endif /* SIM_INTERNAL_PERI_INPUT_T_ */

#if !defined(SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_)
#define SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_
typedef enum _sim_software_contrl_register_index
{
    kSIM_SCR0                       = 0U,          /**< SCR0. */
    kSIM_SCR1                       = 1U,          /**< SCR1. */
    kSIM_SCR2                       = 2U,          /**< SCR2. */
    kSIM_SCR3                       = 3U,          /**< SCR3. */
    kSIM_SCR4                       = 4U,          /**< SCR4. */
    kSIM_SCR5                       = 5U,          /**< SCR5. */
    kSIM_SCR6                       = 6U,          /**< SCR6. */
} sim_software_contrl_register_index_t;
#endif /* SIM_SOFTWARE_CONTRL_REGISTER_INDEX_T_ */

#if !defined(SIM_BOOT_OVERRIDE_MODE_T_)
#define SIM_BOOT_OVERRIDE_MODE_T_
/*!
 * @brief The enumeration of boot over ride mode, FOPT[7:6] | boot_override_mode determines the boot option,
 * the result 11b boots from ROM, while any other values boot from flash.
 */
typedef enum _sim_boot_override_mode
{
    kSIM_BootFromRomOrFlash         = 0U,          /**< Boot from ROM or Flash depending on FOPT[7:6] at next non-POR reset. */
    kSIM_BootFromRom                = 3U,          /**< Boot from ROM at next non-POR reset. */
} sim_boot_override_mode_t;
#endif /* SIM_BOOT_OVERRIDE_MODE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


