zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F81xxx/periph/PERI_SIM.h
#define SIM_CLKOUT_CLKOSEL0_MASK                 (0x7U)
#define SIM_CLKOUT_CLKOSEL0_SHIFT                (0U)
/*! CLKOSEL0 - CLKOUT0 Select
 *  0b000..Function = SYS_CLK continuous after reset
 *  0b001..Function = MSTR_2X_CLK continuous after reset
 *  0b010..Function = DIV2_BUS_CLK (BUS_CLK/2, used for flash memory module) continuous after reset
 *  0b011..Function = MSTR_OSC (master clock) continuous after reset
 *  0b100..Function = FIRC8M (8 MHz / 2 MHz internal reference clock )
 *  0b101..Function = Frosc200K (200 kHz relaxation oscillator clock )
 *  0b110..Reserved. For normal operation, do not write 11x.
 *  0b111..Reserved. For normal operation, do not write 11x.
 */
#define SIM_CLKOUT_CLKOSEL0(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_CLKOUT_CLKOSEL0_SHIFT)) & SIM_CLKOUT_CLKOSEL0_MASK)

#define SIM_CLKOUT_CLKDIS0_MASK                  (0x20U)
#define SIM_CLKOUT_CLKDIS0_SHIFT                 (5U)
/*! CLKDIS0 - Disable for CLKOUT0
 *  0b0..CLKOUT0 output is enabled and outputs the signal indicated by CLKOSEL0
 *  0b1..CLKOUT0 is disabled
 */
#define SIM_CLKOUT_CLKDIS0(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_CLKOUT_CLKDIS0_SHIFT)) & SIM_CLKOUT_CLKDIS0_MASK)

#define SIM_CLKOUT_CLKOSEL1_MASK                 (0x380U)
#define SIM_CLKOUT_CLKOSEL1_SHIFT                (7U)
/*! CLKOSEL1 - CLKOUT1 Select
 *  0b000..Function = SYS_CLK continuous after reset
 *  0b001..Function = MSTR_2X_CLK continuous after reset
 *  0b010..Function = DIV2_BUS_CLK (BUS_CLK/2, used for flash memory module) continuous after reset
 *  0b011..Function = MSTR_OSC (master clock) continuous after reset
 *  0b100..Function = FIRC8M (8 MHz / 2 MHz internal reference clock )
 *  0b101..Function = Frosc200K (200 kHz relaxation oscillator clock )
 *  0b110..Reserved. For normal operation, do not write 11x.
 *  0b111..Reserved. For normal operation, do not write 11x.
 */
#define SIM_CLKOUT_CLKOSEL1(x)                   (((uint16_t)(((uint16_t)(x)) << SIM_CLKOUT_CLKOSEL1_SHIFT)) & SIM_CLKOUT_CLKOSEL1_MASK)

#define SIM_CLKOUT_CLKDIS1_MASK                  (0x1000U)
#define SIM_CLKOUT_CLKDIS1_SHIFT                 (12U)
/*! CLKDIS1 - Disable for CLKOUT1
 *  0b0..CLKOUT1 output is enabled and outputs the signal indicated by CLKOSEL1
 *  0b1..CLKOUT1 is disabled
 */
#define SIM_CLKOUT_CLKDIS1(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_CLKOUT_CLKDIS1_SHIFT)) & SIM_CLKOUT_CLKDIS1_MASK)

#define SIM_CLKOUT_CLKODIV_MASK                  (0xE000U)
#define SIM_CLKOUT_CLKODIV_SHIFT                 (13U)
/*! CLKODIV - CLKOUT divide factor
 *  0b000..Divide by 1
 *  0b001..Divide by 2
 *  0b010..Divide by 4
 *  0b011..Divide by 8
 *  0b100..Divide by 16
 *  0b101..Divide by 32
 *  0b110..Divide by 64
 *  0b111..Divide by 128
 */
#define SIM_CLKOUT_CLKODIV(x)                    (((uint16_t)(((uint16_t)(x)) << SIM_CLKOUT_CLKODIV_SHIFT)) & SIM_CLKOUT_CLKODIV_MASK)
/*! @} */

/*! @name PCR - Peripheral Clock Rate Register */
/*! @{ */

#define SIM_PCR_QDC_CR_MASK                      (0x80U)
#define SIM_PCR_QDC_CR_SHIFT                     (7U)
/*! QDC_CR - QDC Clock Rate
 *  0b0..QDC clock rate equals bus clock rate (default)
 *  0b1..QDC clock rate equals 2X bus clock rate
 */
#define SIM_PCR_QDC_CR(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PCR_QDC_CR_SHIFT)) & SIM_PCR_QDC_CR_MASK)

#define SIM_PCR_LPI2C0_CR_MASK                   (0x100U)
#define SIM_PCR_LPI2C0_CR_SHIFT                  (8U)
/*! LPI2C0_CR - LPI2C0 Clock Rate
 *  0b0..LPI2C0 clock rate equals bus clock rate (default)
 *  0b1..LPI2C0 clock rate equals 2X bus clock rate
 */
#define SIM_PCR_LPI2C0_CR(x)                     (((uint16_t)(((uint16_t)(x)) << SIM_PCR_LPI2C0_CR_SHIFT)) & SIM_PCR_LPI2C0_CR_MASK)

#define SIM_PCR_LPI2C1_CR_MASK                   (0x200U)
#define SIM_PCR_LPI2C1_CR_SHIFT                  (9U)
/*! LPI2C1_CR - LPI2C1 Clock Rate
 *  0b0..LPI2C1 clock rate equals bus clock rate (default)
 *  0b1..LPI2C1 clock rate equals 2X bus clock rate
 */
#define SIM_PCR_LPI2C1_CR(x)                     (((uint16_t)(((uint16_t)(x)) << SIM_PCR_LPI2C1_CR_SHIFT)) & SIM_PCR_LPI2C1_CR_MASK)

#define SIM_PCR_PWM_CR_MASK                      (0x400U)
#define SIM_PCR_PWM_CR_SHIFT                     (10U)
/*! PWM_CR - PWM Clock Rate
 *  0b0..PWM clock rate equals bus clock rate
 *  0b1..PWM clock rate equals 2X bus clock rate (default)
 */
#define SIM_PCR_PWM_CR(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PCR_PWM_CR_SHIFT)) & SIM_PCR_PWM_CR_MASK)

#define SIM_PCR_TMR_CR_MASK                      (0x800U)
#define SIM_PCR_TMR_CR_SHIFT                     (11U)
/*! TMR_CR - TMR Clock Rate
 *  0b0..TMR clock rate equals bus clock rate (default)
 *  0b1..TMR clock rate equals 2X bus clock rate
 */
#define SIM_PCR_TMR_CR(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PCR_TMR_CR_SHIFT)) & SIM_PCR_TMR_CR_MASK)

#define SIM_PCR_SCI1_CR_MASK                     (0x1000U)
#define SIM_PCR_SCI1_CR_SHIFT                    (12U)
/*! SCI1_CR - SCI1 Clock Rate
 *  0b0..SCI1 clock rate equals bus clock rate (default)
 *  0b1..SCI1 clock rate equals 2X bus clock rate
 */
#define SIM_PCR_SCI1_CR(x)                       (((uint16_t)(((uint16_t)(x)) << SIM_PCR_SCI1_CR_SHIFT)) & SIM_PCR_SCI1_CR_MASK)

#define SIM_PCR_SCI0_CR_MASK                     (0x2000U)
#define SIM_PCR_SCI0_CR_SHIFT                    (13U)
/*! SCI0_CR - SCI0 Clock Rate
 *  0b0..SCI0 clock rate equals bus clock rate (default)
 *  0b1..SCI0 clock rate equals 2X bus clock rate
 */
#define SIM_PCR_SCI0_CR(x)                       (((uint16_t)(((uint16_t)(x)) << SIM_PCR_SCI0_CR_SHIFT)) & SIM_PCR_SCI0_CR_MASK)
/*! @} */

/*! @name PCE0 - Peripheral Clock Enable Register 0 */
/*! @{ */

#define SIM_PCE0_GPIOF_MASK                      (0x2U)
#define SIM_PCE0_GPIOF_SHIFT                     (1U)
/*! GPIOF - GPIOF IPBus Clock Enable
 *  0b0..The peripheral is not clocked.
 *  0b1..The peripheral is clocked.
 */
#define SIM_PCE0_GPIOF(x)                        (((uint16_t)(((uint16_t)(x)) << SIM_PCE0_GPIOF_SHIFT)) & SIM_PCE0_GPIOF_MASK)

